//====================================================================================================================
//====================================================================================================================
// src/handler/register.handler.js
// 회원 등록 핸들러
//====================================================================================================================
//====================================================================================================================

import { v4 as uuidv4 } from 'uuid';
import { addUser } from '../models/user.model.js';

const registerHandler = (io) => {
    io.on('connection', (socket) => {
        // 최초 커넥션을 맺은 이후 발생하는 각종 이벤트를 처리하는 곳
        // UUID 생성
        const userUUID = uuidv4();
        // 사용자 추가
        addUser({ uuid: userUUID, socketId: socket.id });

        // 접속 해제 시 이벤트 처리
        socket.on('disconnect', () => handleDisconnect(socket, userUUID));

    });
};

export default registerHandler;